import React from 'react';

const Qusan = () => {
    return (
        <div>
            <h1 className='text-center mt-5'>Qusan & Answer</h1>
            <div className="">
                <h5>1. How react Work?</h5>
                <p>Ans: React is a very popular JavaScript library আপনার এইচটিএমএল কোডটিকে একটি গাছ হিসাবে মনে করুন। আসলে ব্রাউজারটি আপনার DOM (ব্রাউজারে আপনার রেন্ডার করা এইচটিএমএল) এর সাথে ঠিক কীভাবে আচরণ করে। প্রতিক্রিয়া আপনাকে কার্যকরভাবে জাভাস্ক্রিপ্টে আপনার DOM পুনঃনির্মাণ করতে এবং প্রকৃতপক্ষে ঘটে যাওয়া পরিবর্তনগুলিকে DOM-এ পুশ করতে দেয়</p>
                <h5>2. How to useState work.</h5>
                <p>
                Ans: আপনি এই ফাংশনে প্রারম্ভিক অবস্থা পাস করেন এবং এটি বর্তমান অবস্থার মান (প্রাথমিক অবস্থা নয়) এবং এই মান আপডেট করার জন্য অন্য একটি ফাংশন সহ একটি ভেরিয়েবল প্রদান করে।
                </p>
                <h5>3. what is different props vs state?</h5>
                <p>Props এক উপাদান থেকে অন্য উপাদানে ডেটা প্রেরণ করতে ব্যবহৃত হয়।
state হল একটি স্থানীয় ডেটা সঞ্চয়স্থান যা শুধুমাত্র উপাদানগুলির জন্য স্থানীয় এবং অন্যান্য উপাদানগুলিতে প্রেরণ করা যায় না।</p>
            </div>
        </div>
    );
};

export default Qusan;